tests/performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up load"
    # Sustained load phase
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    # Peak load phase
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    # Cool-down phase
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool-down"
  
  # Performance thresholds
  ensure:
    - http.response_time.p95: 2000  # 95th percentile response time < 2s
    - http.response_time.p99: 5000  # 99th percentile response time < 5s
    - http.request_rate: 45         # At least 45 requests per second
    - http.codes.200: 95            # At least 95% success rate
  
  # Load testing configuration
  http:
    timeout: 30
    pool: 50
  
  # Variables for test data
  variables:
    testEmail: "loadtest@example.com"
    testPassword: "LoadTest123!"
    organizationName: "Load Test Org"

scenarios:
  # Authentication flow testing
  - name: "Authentication Flow"
    weight: 20
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/v1/auth/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/v1/auth/logout"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Infrastructure management testing
  - name: "Infrastructure Operations"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/v1/infrastructure/resources"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - post:
          url: "/api/v1/infrastructure/resources"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "load-test-resource-{{ $randomString() }}"
            type: "ec2-instance"
            cloudProvider: "aws"
            region: "us-east-1"
            configuration:
              instanceType: "t3.micro"
          capture:
            - json: "$.id"
              as: "resourceId"
          expect:
            - statusCode: 201
      
      - get:
          url: "/api/v1/infrastructure/resources/{{ resourceId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Deployment operations testing
  - name: "Deployment Operations"
    weight: 25
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/v1/deployments/pipelines"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/v1/deployments/history"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Monitoring operations testing
  - name: "Monitoring Operations"
    weight: 15
    flow:
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "{{ testEmail }}"
            password: "{{ testPassword }}"
          capture:
            - json: "$.token"
              as: "authToken"
      
      - get:
          url: "/api/v1/monitoring/metrics"
          headers:
            Authorization: "Bearer {{ authToken }}"
          qs:
            timeRange: "1h"
            metrics: "cpu,memory"
          expect:
            - statusCode: 200
      
      - get:
          url: "/api/v1/monitoring/alerts"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  # Health check testing
  - name: "Health Checks"
    weight: 10
    flow:
      - get:
          url: "/api/v1/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"
            - equals:
              - "healthy"